# Task 1: Таблица умножения
# Условие: На вход подается число n.
# Написать скрипт в любой парадигме, который выводит на экран таблицу умножения
# всех чисел от 1 до n. Обоснуйте выбор парадигм.

print('\n \t S2 Task 1: Multiplication table')

# Использованные парадигмы: Императивная
# - Структурная - используется for и не требуется goto.
# - Процедурная - требуется повторный вызов для разных значений,
#                 код оформлен в виде процедуры.


def multiplication_table(n):
    for i in range(1, n+1):
        for j in range(1, n+1):
            print(i, 'x', j, '=', i * j)
        print()


n = int(input('Enter a number: '))
multiplication_table(n)
